cnlohr/ch32fun/ch32fun/ch32m030hw.h
#ifndef _CH32M030HW_H
#define _CH32M030HW_H

#include "ch32fun.h"

#ifndef __ASSEMBLER__  // Things before this can be used in assembly.

#ifdef __cplusplus
extern "C" {
#endif

/* Interrupt Number Definition, according to the selected device */
/* Interrupt Number Definition for CH32M030, per RM section 5.3 Table 5-1 */
typedef enum IRQn
{
    /******  RISC-V Processor Core Interrupts ******************************************/
    NonMaskableInt_IRQn  = 2,   /* 2  Non-Maskable Interrupt                    */
    EXC_IRQn             = 3,   /* 3  Exception Interrupt                       */
    Ecall_M_Mode_IRQn    = 5,   /* 5  Machine-mode environment call             */
    Ecall_U_Mode_IRQn    = 8,   /* 8  User-mode environment call                */
    Break_Point_IRQn     = 9,   /* 9  Breakpoint                                */
    SysTick_IRQn         = 12,  /* 12 System Timer Interrupt                    */
    Software_IRQn        = 14,  /* 14 Software Interrupt                        */

    /******  CH32M030 Peripheral Interrupts ********************************************/
    WWDG_IRQn            = 16,  /* Window Watchdog Interrupt                    */
    OPA_IRQn             = 17,  /* OPA global interrupt (moved from 48 on X035) */
    FLASH_IRQn           = 18,  /* FLASH global Interrupt                       */
    RCC_IRQn             = 19,  /* RCC global Interrupt                         */
    EXTI7_0_IRQn         = 20,  /* External Line[7:0] Interrupts                */
    AWU_IRQn             = 21,  /* AWU (Auto Wake-Up) global Interrupt          */
    DMA1_Channel1_IRQn   = 22,  /* DMA1 Channel 1 global Interrupt              */
    DMA1_Channel2_IRQn   = 23,  /* DMA1 Channel 2 global Interrupt              */
    DMA1_Channel3_IRQn   = 24,  /* DMA1 Channel 3 global Interrupt              */
    DMA1_Channel4_IRQn   = 25,  /* DMA1 Channel 4 global Interrupt              */
    DMA1_Channel5_IRQn   = 26,  /* DMA1 Channel 5 global Interrupt              */
    DMA1_Channel6_IRQn   = 27,  /* DMA1 Channel 6 global Interrupt              */
    DMA1_Channel7_IRQn   = 28,  /* DMA1 Channel 7 global Interrupt              */
    ADC_IRQn             = 29,  /* ADC global Interrupt                         */
    I2C1_EV_IRQn         = 30,  /* I2C1 Event Interrupt                         */
    I2C1_ER_IRQn         = 31,  /* I2C1 Error Interrupt                         */
    UART1_IRQn           = 32,  /* UART1 global Interrupt (no synchronous mode) */
    EXTI15_8_IRQn        = 33,  /* External Line[15:8] Interrupts               */
    TIM1_BRK_IRQn        = 34,  /* TIM1 Break Interrupt                         */
    TIM1_UP_IRQn         = 35,  /* TIM1 Update Interrupt                        */
    TIM1_TRG_IRQn        = 36,  /* TIM1 Trigger Interrupt                       */
    TIM1_CC_IRQn         = 37,  /* TIM1 Capture/Compare Interrupt               */
    TIM2_IRQn            = 38,  /* TIM2 global Interrupt                        */
    USBPD0_IRQn          = 39,  /* USB Power Delivery controller 0              */
    USBPD0_WKUP_IRQn     = 40,  /* USBPD0 Wake-Up Interrupt                     */
    USBPD1_IRQn          = 41,  /* USB Power Delivery controller 1              */
    USBPD1_WKUP_IRQn     = 42,  /* USBPD1 Wake-Up Interrupt                     */
    TIM3_IRQn            = 43,  /* TIM3 global Interrupt                        */
    SPI1_IRQn            = 44,  /* SPI1 global Interrupt (moved from 33 on X035)*/
    USBFS_IRQn           = 45,  /* USB Full-Speed global Interrupt              */
    USBFS_WakeUp_IRQn    = 46,  /* USBFS Wake-Up Interrupt                      */
} IRQn_Type;

#define DEFAULT_INTERRUPT_VECTOR_CONTENTS "\n\
	.align  2\n\
	.option   push;\n\
	.option   norvc;\n\
	j handle_reset\n\
	.word   0\n\
	.word   NMI_Handler              /* 2:  NMI */                                       \n\
	.word   HardFault_Handler        /* 3:  Hard Fault */                                \n\
	.word   0\n\
	.word   Ecall_M_Mode_Handler     /* 5:  M-mode ecall */                              \n\
	.word   0\n\
	.word   0\n\
	.word   Ecall_U_Mode_Handler     /* 8:  U-mode ecall */                              \n\
	.word   Break_Point_Handler      /* 9:  Breakpoint */                                \n\
	.word   0\n\
	.word   0\n\
	.word   SysTick_Handler          /* 12: SysTick */                                   \n\
	.word   0\n\
	.word   SW_Handler               /* 14: Software interrupt */                        \n\
	.word   0\n\
	/* External Interrupts (slot 16 onward) */                                           \n\
	.word   WWDG_IRQHandler          /* 16: Window Watchdog */                           \n\
	.word   OPA_IRQHandler           /* 17: OPA (moved from 48 on X035) */               \n\
	.word   FLASH_IRQHandler         /* 18: Flash */                                     \n\
	.word   RCC_IRQHandler           /* 19: RCC */                                       \n\
	.word   EXTI7_0_IRQHandler       /* 20: EXTI Line[7:0] */                            \n\
	.word   AWU_IRQHandler           /* 21: AWU */                                       \n\
	.word   DMA1_Channel1_IRQHandler /* 22: DMA1 Channel 1 */                            \n\
	.word   DMA1_Channel2_IRQHandler /* 23: DMA1 Channel 2 */                            \n\
	.word   DMA1_Channel3_IRQHandler /* 24: DMA1 Channel 3 */                            \n\
	.word   DMA1_Channel4_IRQHandler /* 25: DMA1 Channel 4 */                            \n\
	.word   DMA1_Channel5_IRQHandler /* 26: DMA1 Channel 5 */                            \n\
	.word   DMA1_Channel6_IRQHandler /* 27: DMA1 Channel 6 */                            \n\
	.word   DMA1_Channel7_IRQHandler /* 28: DMA1 Channel 7 */                            \n\
	.word   ADC1_IRQHandler          /* 29: ADC */                                       \n\
	.word   I2C1_EV_IRQHandler       /* 30: I2C1 Event */                                \n\
	.word   I2C1_ER_IRQHandler       /* 31: I2C1 Error */                                \n\
	.word   UART1_IRQHandler         /* 32: UART1 */                                     \n\
	.word   EXTI15_8_IRQHandler      /* 33: EXTI Line[15:8] */                           \n\
	.word   TIM1_BRK_IRQHandler      /* 34: TIM1 Break */                                \n\
	.word   TIM1_UP_IRQHandler       /* 35: TIM1 Update */                               \n\
	.word   TIM1_TRG_IRQHandler      /* 36: TIM1 Trigger */                              \n\
	.word   TIM1_CC_IRQHandler       /* 37: TIM1 Capture/Compare */                      \n\
	.word   TIM2_IRQHandler          /* 38: TIM2 */                                      \n\
	.word   USBPD0_IRQHandler        /* 39: USBPD controller 0 */                        \n\
	.word   USBPD0_WKUP_IRQHandler   /* 40: USBPD0 Wake-Up */                            \n\
	.word   USBPD1_IRQHandler        /* 41: USBPD controller 1 */                        \n\
	.word   USBPD1_WKUP_IRQHandler   /* 42: USBPD1 Wake-Up */                            \n\
	.word   TIM3_IRQHandler          /* 43: TIM3 */                                      \n\
	.word   SPI1_IRQHandler          /* 44: SPI1 (moved from 33 on X035) */              \n\
	.word   USBFS_IRQHandler         /* 45: USBFS */                                     \n\
	.word   USBFSWakeUp_IRQHandler   /* 46: USBFS Wake-Up */                             \n\
	.option   pop;\n"
    
/* memory mapped structure for SysTick */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t SR;
  union
  {
     struct
     {
        __IO uint32_t CNTL;
        __IO uint32_t CNTH;
        __IO uint32_t CMPL;
        __IO uint32_t CMPH;
     };
     struct
     {
        __IO uint64_t CNT;
        __IO uint64_t CMP;
     };
  };
} SysTick_Type;

#define funSysTick32() (SysTick->CNTL)
#define funSysTickHigh() (SysTick->CNTH)

#endif /* __ASSEMBLER__*/

#define HardFault_IRQn    EXC_IRQn

	#define ADC1_2_IRQn       ADC_IRQn

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value             HSI_VALUE
#define HSE_Value             HSE_VALUE
#define HSEStartUp_TimeOut    HSE_STARTUP_TIMEOUT

