cnlohr/ch32fun/ch32fun/ch32m030hw.h
	__IO uint16_t RESERVED14;
	__IO uint16_t RESERVED15;
	__IO uint16_t RESERVED16;

	__IO uint16_t HOST_SETUP;
	__IO uint16_t HOST_EP_PID;
	__IO uint16_t HOST_RX_CTL;
	__IO uint16_t HOST_TX_LEN;
	__IO uint16_t HOST_TX_CTL;

	__IO uint16_t RESERVED20;
	__IO uint16_t RESERVED21;

	__IO uint32_t RESERVED22[8];

	__IO uint32_t RESERVED23;
	__IO uint32_t RESERVED24;
	__IO uint32_t RESERVED25;

	__IO uint32_t RESERVED26;

	__IO uint16_t RESERVED27;
	__IO uint16_t RESERVED28;

	__IO uint16_t RESERVED29;
	__IO uint16_t RESERVED30;

	__IO uint16_t RESERVED31;
	__IO uint16_t RESERVED32;

	__IO uint32_t RESERVED33;
} USBDH_TypeDef;


/* USB Power Delivery */
typedef struct
{
	__IO uint32_t CONFIG;
	__IO uint32_t CONTROL;
	__IO uint32_t STATUS;
	__IO uint32_t PORT;
	__IO uint32_t DMA;
} USBPD_TypeDef;


/* USB Power Delivery */
typedef struct
{
	__IO uint16_t CONFIG;
	__IO uint16_t BMC_CLK_CNT;

	__IO uint8_t CONTROL;
	__IO uint8_t TX_SEL;
	__IO uint16_t BMC_TX_SZ;

	__IO uint8_t DATA_BUF;
	__IO uint8_t STATUS;
	__IO uint16_t BMC_BYTE_CNT;

	__IO uint16_t PORT_CC1;
	__IO uint16_t PORT_CC2;

	__IO uint32_t DMA;
} USBPD_DETAILED_TypeDef;




/* memory mapped structure for Program Fast Interrupt Controller (PFIC) */
typedef struct{
    __I  uint32_t ISR[8];
    __I  uint32_t IPR[8];
    __IO uint32_t ITHRESDR;
    __IO uint32_t RESERVED;
    __IO uint32_t CFGR;
    __I  uint32_t GISR;
    __IO uint8_t VTFIDR[4];
    uint8_t RESERVED0[12];
    __IO uint32_t VTFADDR[4];
    uint8_t RESERVED1[0x90];
    __O  uint32_t IENR[8];
    uint8_t RESERVED2[0x60];
    __O  uint32_t IRER[8];
    uint8_t RESERVED3[0x60];
    __O  uint32_t IPSR[8];
    uint8_t RESERVED4[0x60];
    __O  uint32_t IPRR[8];
    uint8_t RESERVED5[0x60];
    __IO uint32_t IACTR[8];
    uint8_t RESERVED6[0xE0];
    __IO uint8_t IPRIOR[256];
    uint8_t RESERVED7[0x810];
    __IO uint32_t SCTLR;
}PFIC_Type;

#endif // !__ASSEMBLER__

/* Peripheral memory map */
#ifdef __ASSEMBLER__
#define FLASH_BASE                              (0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               (0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             (0x40000000) /* Peripheral base address in the alias region */
#define CORE_PERIPH_BASE                        (0xE0000000) /* System peripherals base address in the alias region */
#else
#define FLASH_BASE                              ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             ((uint32_t)0x40000000) /* Peripheral base address in the alias region */
#define CORE_PERIPH_BASE                        ((uint32_t)0xE0000000) /* System peripherals base address in the alias region */
#endif


#define APB1PERIPH_BASE                         (PERIPH_BASE)
#define APB2PERIPH_BASE                         (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE                          (PERIPH_BASE + 0x20000)

/* APB1 peripherals (CH32M030 RM v1.2 §1.2) */
#define TIM2_BASE                               (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE                               (APB1PERIPH_BASE + 0x0400)
#define WWDG_BASE                               (APB1PERIPH_BASE + 0x2C00)
/* M030 has no IWDG, no USART2/3/4 — removed vs. X035 */
#define I2C1_BASE                               (APB1PERIPH_BASE + 0x5400)
#define PWR_BASE                                (APB1PERIPH_BASE + 0x7000)
/* AWU on M030 is folded into PWR (R32_PWR_AWUCSR @ 0x40007008,
   R32_PWR_AWUWR @ 0x4000700C) — no standalone AWU peripheral */

/* APB2 peripherals (CH32M030 RM v1.2 §1.2) */
#define AFIO_BASE                               (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                               (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                              (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                              (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                              (APB2PERIPH_BASE + 0x1000) /* PC0-PC5 only, CFGLR only (no CFGHR) */
/* M030 has no GPIOD — removed vs. X035 */
#define ADC1_BASE                               (APB2PERIPH_BASE + 0x2400)
#define TIM1_BASE                               (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                               (APB2PERIPH_BASE + 0x3000)
#define USART1_BASE                             (APB2PERIPH_BASE + 0x3800) /* WCH names this UART1 on M030 (no sync mode) */
#define UART1_BASE                              USART1_BASE                /* Alias matching M030 RM naming */

/* AHB peripherals (CH32M030 RM v1.2 §1.2) */
#define DMA1_BASE                               (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                      (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                      (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                      (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                      (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                      (AHBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                      (AHBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                      (AHBPERIPH_BASE + 0x0080)
/* M030 DMA has 7 channels only — Channel 8 removed vs. X035 */
#define RCC_BASE                                (AHBPERIPH_BASE + 0x1000)

#define FLASH_R_BASE                            (AHBPERIPH_BASE + 0x2000) /* Flash registers base address */

#define USBFS_BASE                              (AHBPERIPH_BASE + 0x3400) /* §16 */
#define EXTEN_BASE                              (AHBPERIPH_BASE + 0x3800) /* §20 */
#define USBPD0_BASE                             (AHBPERIPH_BASE + 0x4000) /* §15 — controller 0 */
#define USBPD1_BASE                             (AHBPERIPH_BASE + 0x4400) /* §15 — controller 1 */
#define OPA_BASE                                (AHBPERIPH_BASE + 0x4800) /* §17 — QII/ISP/CMP block; struct rewrite TBD */
/* M030 has no standalone AWU and no PIOC — removed vs. X035 */


#define OB_BASE                                 ((uint32_t)0x1FFFF800)    /* Flash Option Bytes base address */
#define ESIG_BASE                               ((uint32_t)0x1FFFF7E0)
#define INFO_BASE                               ((uint32_t)0x1FFFF704)

