cnlohr/ch32fun/ch32fun/ch32m030hw.h
#define AFIO_EXTICR1_EXTI8_PA                   ((uint32_t)0x00000000) /* PA[8] pin */
#define AFIO_EXTICR1_EXTI8_PB                   ((uint32_t)0x00010000) /* PB[8] pin */
#define AFIO_EXTICR1_EXTI8_PC                   ((uint32_t)0x00020000) /* PC[8] pin */

#define AFIO_EXTICR1_EXTI9_PA                   ((uint32_t)0x00000000) /* PA[9] pin */
#define AFIO_EXTICR1_EXTI9_PB                   ((uint32_t)0x00040000) /* PB[9] pin */
#define AFIO_EXTICR1_EXTI9_PC                   ((uint32_t)0x00080000) /* PC[9] pin */

#define AFIO_EXTICR1_EXTI10_PA                  ((uint32_t)0x00000000) /* PA[10] pin */
#define AFIO_EXTICR1_EXTI10_PB                  ((uint32_t)0x00100000) /* PB[10] pin */
#define AFIO_EXTICR1_EXTI10_PC                  ((uint32_t)0x00200000) /* PC[10] pin */

#define AFIO_EXTICR1_EXTI11_PA                  ((uint32_t)0x00000000) /* PA[11] pin */
#define AFIO_EXTICR1_EXTI11_PB                  ((uint32_t)0x00400000) /* PB[11] pin */
#define AFIO_EXTICR1_EXTI11_PC                  ((uint32_t)0x00800000) /* PC[11] pin */

#define AFIO_EXTICR1_EXTI12_PA                  ((uint32_t)0x00000000) /* PA[12] pin */
#define AFIO_EXTICR1_EXTI12_PB                  ((uint32_t)0x01000000) /* PB[12] pin */
#define AFIO_EXTICR1_EXTI12_PC                  ((uint32_t)0x02000000) /* PC[12] pin */

#define AFIO_EXTICR1_EXTI13_PA                  ((uint32_t)0x00000000) /* PA[13] pin */
#define AFIO_EXTICR1_EXTI13_PB                  ((uint32_t)0x04000000) /* PB[13] pin */
#define AFIO_EXTICR1_EXTI13_PC                  ((uint32_t)0x08000000) /* PC[13] pin */

#define AFIO_EXTICR1_EXTI14_PA                  ((uint32_t)0x00000000) /* PA[14] pin */
#define AFIO_EXTICR1_EXTI14_PB                  ((uint32_t)0x10000000) /* PB[14] pin */
#define AFIO_EXTICR1_EXTI14_PC                  ((uint32_t)0x20000000) /* PC[14] pin */

#define AFIO_EXTICR1_EXTI15_PA                  ((uint32_t)0x00000000) /* PA[15] pin */
#define AFIO_EXTICR1_EXTI15_PB                  ((uint32_t)0x40000000) /* PB[15] pin */
#define AFIO_EXTICR1_EXTI15_PC                  ((uint32_t)0x80000000) /* PC[15] pin */

/*****************  Bit definition for AFIO_EXTICR2 register  *****************/
#define AFIO_EXTICR2_EXTI16                     ((uint16_t)0x00000003) /* EXTI 16 configuration */
#define AFIO_EXTICR2_EXTI17                     ((uint16_t)0x0000000C) /* EXTI 17 configuration */
#define AFIO_EXTICR2_EXTI18                     ((uint16_t)0x00000030) /* EXTI 18 configuration */
#define AFIO_EXTICR2_EXTI19                     ((uint16_t)0x000000C0) /* EXTI 19 configuration */
#define AFIO_EXTICR2_EXTI20                     ((uint16_t)0x00000300) /* EXTI 20 configuration */
#define AFIO_EXTICR2_EXTI21                     ((uint16_t)0x00000C00) /* EXTI 21 configuration */
#define AFIO_EXTICR2_EXTI22                     ((uint16_t)0x00003000) /* EXTI 22 configuration */
#define AFIO_EXTICR2_EXTI23                     ((uint16_t)0x0000C000) /* EXTI 23 configuration */

#define AFIO_EXTICR2_EXTI16_PA                  ((uint16_t)0x00000000) /* PA[16] pin */
#define AFIO_EXTICR2_EXTI16_PB                  ((uint16_t)0x00000001) /* PB[16] pin */
#define AFIO_EXTICR2_EXTI16_PC                  ((uint16_t)0x00000002) /* PC[16] pin */

#define AFIO_EXTICR2_EXTI17_PA                  ((uint16_t)0x00000000) /* PA[17] pin */
#define AFIO_EXTICR2_EXTI17_PB                  ((uint16_t)0x00000004) /* PB[17] pin */
#define AFIO_EXTICR2_EXTI17_PC                  ((uint16_t)0x00000008) /* PC[17] pin */

#define AFIO_EXTICR2_EXTI18_PA                  ((uint16_t)0x00000000) /* PA[18] pin */
#define AFIO_EXTICR2_EXTI18_PB                  ((uint16_t)0x00000010) /* PB[18] pin */
#define AFIO_EXTICR2_EXTI18_PC                  ((uint16_t)0x00000020) /* PC[18] pin */

#define AFIO_EXTICR2_EXTI19_PA                  ((uint16_t)0x00000000) /* PA[19] pin */
#define AFIO_EXTICR2_EXTI19_PB                  ((uint16_t)0x00000040) /* PB[19] pin */
#define AFIO_EXTICR2_EXTI19_PC                  ((uint16_t)0x00000080) /* PC[19] pin */

#define AFIO_EXTICR2_EXTI20_PA                  ((uint16_t)0x00000000) /* PA[20] pin */
#define AFIO_EXTICR2_EXTI20_PB                  ((uint16_t)0x00000100) /* PB[20] pin */
#define AFIO_EXTICR2_EXTI20_PC                  ((uint16_t)0x00000200) /* PC[20] pin */

#define AFIO_EXTICR2_EXTI21_PA                  ((uint16_t)0x00000000) /* PA[21] pin */
#define AFIO_EXTICR2_EXTI21_PB                  ((uint16_t)0x00000400) /* PB[21] pin */
#define AFIO_EXTICR2_EXTI21_PC                  ((uint16_t)0x00000800) /* PC[21] pin */

#define AFIO_EXTICR2_EXTI22_PA                  ((uint16_t)0x00000000) /* PA[22] pin */
#define AFIO_EXTICR2_EXTI22_PB                  ((uint16_t)0x00001000) /* PB[22] pin */
#define AFIO_EXTICR2_EXTI22_PC                  ((uint16_t)0x00002000) /* PC[22] pin */

#define AFIO_EXTICR2_EXTI23_PA                  ((uint16_t)0x00000000) /* PA[23] pin */
#define AFIO_EXTICR2_EXTI23_PB                  ((uint16_t)0x00004000) /* PB[23] pin */
#define AFIO_EXTICR2_EXTI23_PC                  ((uint16_t)0x00008000) /* PC[23] pin */

/*******************  Bit definition for AFIO_CTLR register  ********************/
#define AFIO_CTLR_UDM_PUE                       ((uint32_t)0x00000003) /* PC16/UDM Pin pull-up Mode*/
#define AFIO_CTLR_UDM_PUE_0                     ((uint32_t)0x00000001) /* bit[0] */
#define AFIO_CTLR_UDM_PUE_1                     ((uint32_t)0x00000002) /* bit[1] */

#define UDM_PUE_MASK                0x00000003
#define UDM_PUE_DISABLE             0x00000000
#define UDM_PUE_35UA                0x00000001
#define UDM_PUE_10K                 0x00000002
#define UDM_PUE_1K5                 0x00000003

#define AFIO_CTLR_UDP_PUE                       ((uint32_t)0x0000000C) /* PC17/UDP Pin pull-up Mode*/
#define AFIO_CTLR_UDP_PUE_0                     ((uint32_t)0x00000004) /* bit[2] */
#define AFIO_CTLR_UDP_PUE_1                     ((uint32_t)0x00000008) /* bit[3] */

#define UDP_PUE_MASK                0x0000000C
#define UDP_PUE_DISABLE             0x00000000
#define UDP_PUE_35UA                0x00000004
#define UDP_PUE_10K                 0x00000008
#define UDP_PUE_1K5                 0x0000000C

