cnlohr/ch32fun/ch32fun/ch32m030hw.h
/* HB clock source prescaler HPRE[10:4] — M030 has 7-bit HPRE, not X035's 4-bit.
   Encoding: 0000000=/1, 0000001=/2, 0000010=/3, ... 1111111=/128 (per RM 3.4.2). */
#define RCC_HPRE                                ((uint32_t)0x000007F0) /* HPRE[6:0] field mask */
#define RCC_HPRE_DIV1                           ((uint32_t)0x00000000) /* SYSCLK not divided */
#define RCC_HPRE_DIV2                           ((uint32_t)0x00000010) /* SYSCLK divided by 2 */
#define RCC_HPRE_DIV3                           ((uint32_t)0x00000020) /* SYSCLK divided by 3 */
#define RCC_HPRE_DIV4                           ((uint32_t)0x00000030) /* SYSCLK divided by 4 */
#define RCC_HPRE_DIV8                           ((uint32_t)0x00000070) /* SYSCLK divided by 8 */
#define RCC_HPRE_DIV16                          ((uint32_t)0x000000F0) /* SYSCLK divided by 16 */
#define RCC_HPRE_DIV32                          ((uint32_t)0x000001F0) /* SYSCLK divided by 32 */
#define RCC_HPRE_DIV64                          ((uint32_t)0x000003F0) /* SYSCLK divided by 64 */
#define RCC_HPRE_DIV128                         ((uint32_t)0x000007F0) /* SYSCLK divided by 128 */

/* M030 has NO PPRE1 / PPRE2 fields — APB1 and APB2 buses run at HCLK on this chip.
   The X035-style RCC_PPRE1_xxx and RCC_PPRE2_xxx defines are deliberately omitted. */

/* ADC clock source prescaler ADCPRE[15:11] — M030 has 5-bit ADCPRE, not X035's 2-bit.
   Only a subset of encodings are commonly used; see RM 3.4.2 for full table. */
#define RCC_ADCPRE                              ((uint32_t)0x0000F800) /* ADCPRE[4:0] field mask */
#define RCC_ADCPRE_DIV2                         ((uint32_t)0x00000000) /* HB/2 */
#define RCC_ADCPRE_DIV4                         ((uint32_t)0x00002000) /* HB/4  (encoding 00100b << 11) */
#define RCC_ADCPRE_DIV6                         ((uint32_t)0x00004000) /* HB/6  (encoding 01000b << 11) */
#define RCC_ADCPRE_DIV8                         ((uint32_t)0x00006000) /* HB/8  (encoding 01100b << 11) */
#define RCC_ADCPRE_DIV12                        ((uint32_t)0x0000A000) /* HB/12 (encoding 10100b << 11) */
#define RCC_ADCPRE_DIV16                        ((uint32_t)0x0000E000) /* HB/16 (encoding 11100b << 11) */

/* PLL entry clock source */
#define RCC_PLLSRC                              ((uint32_t)0x00010000) /* PLLSRC bit 16: 1=HSE, 0=HSI */

/* M030 PLL has a FIXED multiplier (not user-programmable). The X035-style
   RCC_PLLMULL, RCC_PLLMULL2..16, RCC_PLLXTPRE, RCC_USBPRE defines do not apply
   and are deliberately omitted. SYSCLK target is 72 MHz from 8 MHz HSI (see RM
   clock-tree diagram); the multiplier is selected internally by the chip. */

/* MCO[2:0] microcontroller clock output */
#define RCC_CFGR0_MCO                           ((uint32_t)0x07000000) /* MCO[26:24] mask */
#define RCC_MCO_0                               ((uint32_t)0x01000000)
#define RCC_MCO_1                               ((uint32_t)0x02000000)
#define RCC_MCO_2                               ((uint32_t)0x04000000)

#define RCC_MCO_NOCLOCK                         ((uint32_t)0x00000000) /* 0xx: no clock output */
#define RCC_CFGR0_MCO_SYSCLK                    ((uint32_t)0x04000000) /* 100: SYSCLK output */
#define RCC_CFGR0_MCO_HSI                       ((uint32_t)0x05000000) /* 101: HSI output */
#define RCC_CFGR0_MCO_HSE                       ((uint32_t)0x06000000) /* 110: HSE output */
/* 111 is Reserved on M030 (X035 used it for PLL/2 output) */

/* ADC clock duty-cycle select (M030-only addition vs X035 CFGR0) */
#define RCC_ADC_DUTY_SEL                        ((uint32_t)0x10000000) /* bit 28: 1=75% duty, 0=50% */


/*******************  Bit definition for RCC_INTR register  ********************/
/* M030 has no LSE crystal — LSE flag/IE/clear bits are NOT defined */
#define RCC_LSIRDYF                             ((uint32_t)0x00000001) /* LSI Ready Interrupt flag */
#define RCC_HSIRDYF                             ((uint32_t)0x00000004) /* HSI Ready Interrupt flag */
#define RCC_HSERDYF                             ((uint32_t)0x00000008) /* HSE Ready Interrupt flag */
#define RCC_PLLRDYF                             ((uint32_t)0x00000010) /* PLL Ready Interrupt flag */
#define RCC_LSIRDYIE                            ((uint32_t)0x00000100) /* LSI Ready Interrupt Enable */
#define RCC_HSIRDYIE                            ((uint32_t)0x00000400) /* HSI Ready Interrupt Enable */
#define RCC_HSERDYIE                            ((uint32_t)0x00000800) /* HSE Ready Interrupt Enable */
#define RCC_PLLRDYIE                            ((uint32_t)0x00001000) /* PLL Ready Interrupt Enable */
#define RCC_LSIRDYC                             ((uint32_t)0x00010000) /* LSI Ready Interrupt Clear */
#define RCC_HSIRDYC                             ((uint32_t)0x00040000) /* HSI Ready Interrupt Clear */
#define RCC_HSERDYC                             ((uint32_t)0x00080000) /* HSE Ready Interrupt Clear */
#define RCC_PLLRDYC                             ((uint32_t)0x00100000) /* PLL Ready Interrupt Clear */


/*****************  Bit definition for RCC_PB2PRSTR register  *****************/
/* (M030 RM calls this PB2PRSTR; the struct field stays named APB2PRSTR for X035 compat) */
#define RCC_AFIORST                             ((uint32_t)0x00000001) /* AFIO reset, bit 0 */
#define RCC_IOPARST                             ((uint32_t)0x00000004) /* GPIOA reset, bit 2 */
#define RCC_IOPBRST                             ((uint32_t)0x00000008) /* GPIOB reset, bit 3 */
#define RCC_IOPCRST                             ((uint32_t)0x00000010) /* GPIOC reset, bit 4 */
#define RCC_ADC1RST                             ((uint32_t)0x00000200) /* ADC1 reset, bit 9 */
#define RCC_TIM1RST                             ((uint32_t)0x00000800) /* TIM1 reset, bit 11 */
#define RCC_SPI1RST                             ((uint32_t)0x00001000) /* SPI1 reset, bit 12 */
#define RCC_USART1RST                           ((uint32_t)0x00004000) /* UART1 reset, bit 14 */
#define RCC_UART1RST                            RCC_USART1RST          /* Alias matching M030 RM */
/* Removed (not present on M030): IOPDRST, IOPERST, ADC2RST */


/*****************  Bit definition for RCC_PB1PRSTR register  *****************/
/* (M030 RM calls this PB1PRSTR; struct field stays named APB1PRSTR for X035 compat) */
#define RCC_TIM2RST                             ((uint32_t)0x00000001) /* TIM2 reset, bit 0 */
#define RCC_TIM3RST                             ((uint32_t)0x00000002) /* TIM3 reset, bit 1 */
#define RCC_WWDGRST                             ((uint32_t)0x00000800) /* WWDG reset, bit 11 */
#define RCC_I2C1RST                             ((uint32_t)0x00200000) /* I2C1 reset, bit 21 */
#define RCC_PWRRST                              ((uint32_t)0x10000000) /* PWR reset, bit 28 */
/* Removed (not present on M030): USART2/3/4 RST, CAN1RST, BKPRST,
   TIM4RST (bit 2 collides with TIM3RST!), SPI2RST, I2C2RST, USBRST */


/******************  Bit definition for RCC_AHBPCENR register  ******************/
#define RCC_DMA1EN                              ((uint32_t)0x00000001) /* DMA1 clock enable, bit 0 */
#define RCC_SRAMEN                              ((uint32_t)0x00000004) /* SRAM interface clock enable, bit 2 */
#define RCC_USBFSEN                             ((uint32_t)0x00000008) /* USBFS clock enable, bit 3 */
#define RCC_USBFS                               RCC_USBFSEN            /* Alias kept for source compat */
#define RCC_USBPD0EN                            ((uint32_t)0x00000010) /* USBPD0 clock enable, bit 4 */
#define RCC_USBPD1EN                            ((uint32_t)0x00000020) /* USBPD1 clock enable, bit 5 */
#define RCC_OPAEN                               ((uint32_t)0x00000080) /* OPA/CMP block clock enable, bit 7 */
/* Removed (not present on M030): FLITFEN, CRCEN, USBHD, single USBPD bit */


/******************  Bit definition for RCC_PB2PCENR register  *****************/
/* (M030 RM calls this PB2PCENR; struct field stays APB2PCENR for X035 compat) */
#define RCC_AFIOEN                              ((uint32_t)0x00000001) /* AFIO clock enable, bit 0 */
#define RCC_IOPAEN                              ((uint32_t)0x00000004) /* GPIOA clock enable, bit 2 */
#define RCC_IOPBEN                              ((uint32_t)0x00000008) /* GPIOB clock enable, bit 3 */
#define RCC_IOPCEN                              ((uint32_t)0x00000010) /* GPIOC clock enable, bit 4 */
#define RCC_ADC1EN                              ((uint32_t)0x00000200) /* ADC1 clock enable, bit 9 */
#define RCC_TIM1EN                              ((uint32_t)0x00000800) /* TIM1 clock enable, bit 11 */
#define RCC_SPI1EN                              ((uint32_t)0x00001000) /* SPI1 clock enable, bit 12 */
#define RCC_USART1EN                            ((uint32_t)0x00004000) /* UART1 clock enable, bit 14 */
#define RCC_UART1EN                             RCC_USART1EN           /* Alias matching M030 RM */
/* Removed (not present on M030): IOPDEN, ADC2EN */


/*****************  Bit definition for RCC_PB1PCENR register  ******************/
/* (M030 RM calls this PB1PCENR; struct field stays APB1PCENR for X035 compat) */
#define RCC_TIM2EN                              ((uint32_t)0x00000001) /* TIM2 clock enable, bit 0 */
#define RCC_TIM3EN                              ((uint32_t)0x00000002) /* TIM3 clock enable, bit 1 */
#define RCC_WWDGEN                              ((uint32_t)0x00000800) /* WWDG clock enable, bit 11 */
#define RCC_I2C1EN                              ((uint32_t)0x00200000) /* I2C1 clock enable, bit 21 */
#define RCC_PWREN                               ((uint32_t)0x10000000) /* PWR clock enable, bit 28 */
/* Removed (not present on M030): USART2/3/4 EN, BKPEN, USBEN */


/*******************  Bit definition for RCC_RSTSCKR register  ********************/
#define RCC_LSION                               ((uint32_t)0x00000001) /* LSI enable, bit 0 */
#define RCC_LSIRDY                              ((uint32_t)0x00000002) /* LSI ready flag, bit 1 */
#define RCC_USBPD0RSTF                          ((uint32_t)0x00400000) /* USBPD0 reset flag, bit 22 */
#define RCC_USBPD1RSTF                          ((uint32_t)0x00800000) /* USBPD1 reset flag, bit 23 */
#define RCC_RMVF                                ((uint32_t)0x01000000) /* Clear reset flags, bit 24 */
#define RCC_ADC_AWDRSTF                         ((uint32_t)0x02000000) /* ADC analog watchdog reset flag, bit 25 */
#define RCC_PINRSTF                             ((uint32_t)0x04000000) /* NRST pin reset flag, bit 26 */
#define RCC_PORRSTF                             ((uint32_t)0x08000000) /* POR/PDR reset flag, bit 27 */
#define RCC_SFTRSTF                             ((uint32_t)0x10000000) /* Software reset flag, bit 28 */
#define RCC_WWDGRSTF                            ((uint32_t)0x40000000) /* Window watchdog reset flag, bit 30 */
#define RCC_LPWRRSTF                            ((uint32_t)0x80000000) /* Low-power reset flag, bit 31 */
/* Removed (not present on M030): OPARSTF (was bit 25, M030 reuses bit 25 for ADC_AWDRSTF),
   IWDGRSTF (M030 has no IWDG) */


/******************  Bit definition for RCC_AHBRSTR register  *****************/
#define RCC_USBFSRST                            ((uint32_t)0x00000008) /* USBFS reset, bit 3 */
#define RCC_USBPD0RST                           ((uint32_t)0x00000010) /* USBPD0 reset, bit 4 */
#define RCC_USBPD1RST                           ((uint32_t)0x00000020) /* USBPD1 reset, bit 5 */
#define RCC_OPARST                              ((uint32_t)0x00000080) /* OPA/CMP reset, bit 7 */
/* Removed (not present on M030): PIOCRST, single USBPDRST */

/******************************************************************************/
/*                        Serial Peripheral Interface                         */
/******************************************************************************/

/*******************  Bit definition for SPI_CTLR1 register  ********************/
#define SPI_CTLR1_CPHA                          ((uint16_t)0x0001) /* Clock Phase */
#define SPI_CTLR1_CPOL                          ((uint16_t)0x0002) /* Clock Polarity */
#define SPI_CTLR1_MSTR                          ((uint16_t)0x0004) /* Master Selection */

#define SPI_CTLR1_BR                            ((uint16_t)0x0038) /* BR[2:0] bits (Baud Rate Control) */
#define SPI_CTLR1_BR_0                          ((uint16_t)0x0008) /* Bit 0 */
#define SPI_CTLR1_BR_1                          ((uint16_t)0x0010) /* Bit 1 */
#define SPI_CTLR1_BR_2                          ((uint16_t)0x0020) /* Bit 2 */

#define SPI_CTLR1_SPE                           ((uint16_t)0x0040) /* SPI Enable */
#define SPI_CTLR1_LSBFIRST                      ((uint16_t)0x0080) /* Frame Format */
#define SPI_CTLR1_SSI                           ((uint16_t)0x0100) /* Internal slave select */
#define SPI_CTLR1_SSM                           ((uint16_t)0x0200) /* Software slave management */
#define SPI_CTLR1_RXONLY                        ((uint16_t)0x0400) /* Receive only */
#define SPI_CTLR1_DFF                           ((uint16_t)0x0800) /* Data Frame Format */
#define SPI_CTLR1_CRCNEXT                       ((uint16_t)0x1000) /* Transmit CRC next */
#define SPI_CTLR1_CRCEN                         ((uint16_t)0x2000) /* Hardware CRC calculation enable */
#define SPI_CTLR1_BIDIOE                        ((uint16_t)0x4000) /* Output enable in bidirectional mode */
#define SPI_CTLR1_BIDIMODE                      ((uint16_t)0x8000) /* Bidirectional data mode enable */

/*******************  Bit definition for SPI_CTLR2 register  ********************/
#define SPI_CTLR2_RXDMAEN                       ((uint8_t)0x01) /* Rx Buffer DMA Enable */
#define SPI_CTLR2_TXDMAEN                       ((uint8_t)0x02) /* Tx Buffer DMA Enable */
#define SPI_CTLR2_SSOE                          ((uint8_t)0x04) /* SS Output Enable */
#define SPI_CTLR2_ERRIE                         ((uint8_t)0x20) /* Error Interrupt Enable */
#define SPI_CTLR2_RXNEIE                        ((uint8_t)0x40) /* RX buffer Not Empty Interrupt Enable */
#define SPI_CTLR2_TXEIE                         ((uint8_t)0x80) /* Tx buffer Empty Interrupt Enable */
#define SPI_CTLR2_ODEN                          ((uint16_t)0x8000) /* SPI OD output Enable */

/********************  Bit definition for SPI_STATR register  ********************/
#define SPI_STATR_RXNE                          ((uint8_t)0x01) /* Receive buffer Not Empty */
#define SPI_STATR_TXE                           ((uint8_t)0x02) /* Transmit buffer Empty */
#define SPI_STATR_CHSIDE                        ((uint8_t)0x04) /* Channel side */
#define SPI_STATR_UDR                           ((uint8_t)0x08) /* Underrun flag */
#define SPI_STATR_CRCERR                        ((uint8_t)0x10) /* CRC Error flag */
#define SPI_STATR_MODF                          ((uint8_t)0x20) /* Mode fault */
#define SPI_STATR_OVR                           ((uint8_t)0x40) /* Overrun flag */
#define SPI_STATR_BSY                           ((uint8_t)0x80) /* Busy flag */

/********************  Bit definition for SPI_DATAR register  ********************/
#define SPI_DATAR_DR                            ((uint16_t)0xFFFF) /* Data Register */

/*******************  Bit definition for SPI_CRCR register  ******************/
#define SPI_CRCR_CRCPOLY                        ((uint16_t)0xFFFF) /* CRC polynomial register */

/******************  Bit definition for SPI_RCRCR register  ******************/
#define SPI_RCRCR_RXCRC                         ((uint16_t)0xFFFF) /* Rx CRC Register */

/******************  Bit definition for SPI_TCRCR register  ******************/
#define SPI_TCRCR_TXCRC                         ((uint16_t)0xFFFF) /* Tx CRC Register */

/******************  Bit definition for SPI_HSCR register  *****************/
#define SPI_HSCR_HSRXEN                         ((uint16_t)0x0001) /* Read Enable under SPI High speed mode */

/******************************************************************************/
/*                                    TIM                                     */
/******************************************************************************/

/*******************  Bit definition for TIM_CTLR1 register  ********************/
#define TIM_CEN                                 ((uint16_t)0x0001) /* Counter enable */
#define TIM_UDIS                                ((uint16_t)0x0002) /* Update disable */
#define TIM_URS                                 ((uint16_t)0x0004) /* Update request source */
#define TIM_OPM                                 ((uint16_t)0x0008) /* One pulse mode */
#define TIM_DIR                                 ((uint16_t)0x0010) /* Direction */

#define TIM_CMS                                 ((uint16_t)0x0060) /* CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CMS_0                               ((uint16_t)0x0020) /* Bit 0 */
#define TIM_CMS_1                               ((uint16_t)0x0040) /* Bit 1 */

#define TIM_ARPE                                ((uint16_t)0x0080) /* Auto-reload preload enable */

#define TIM_CTLR1_CKD                           ((uint16_t)0x0300) /* CKD[1:0] bits (clock division) */
#define TIM_CKD_0                               ((uint16_t)0x0100) /* Bit 0 */
#define TIM_CKD_1                               ((uint16_t)0x0200) /* Bit 1 */

#define TIM_CMP_BK                              ((uint16_t)0x1000) /* voltage comparator break enable, TIM1 only */
#define TIM_CAPOV                               ((uint16_t)0x4000) /* Cfg mode of capture value */
#define TIM_CAPLVL                              ((uint16_t)0x8000) 

