cnlohr/ch32fun/ch32fun/ch32m030hw.h
/* ADC_clock */
#define ADC_CLK_Div4                                   ((uint32_t)0x00000013)
#define ADC_CLK_Div5                                   ((uint32_t)0x00000014)
#define ADC_CLK_Div6                                   ((uint32_t)0x00000025)
#define ADC_CLK_Div7                                   ((uint32_t)0x00000026)
#define ADC_CLK_Div8                                   ((uint32_t)0x00000037)
#define ADC_CLK_Div9                                   ((uint32_t)0x00000038)
#define ADC_CLK_Div10                                  ((uint32_t)0x00000049)
#define ADC_CLK_Div11                                  ((uint32_t)0x0000004A)
#define ADC_CLK_Div12                                  ((uint32_t)0x0000005B)
#define ADC_CLK_Div13                                  ((uint32_t)0x0000005C)
#define ADC_CLK_Div14                                  ((uint32_t)0x0000006D)
#define ADC_CLK_Div15                                  ((uint32_t)0x0000006E)
#define ADC_CLK_Div16                                  ((uint32_t)0x0000007F)


/* PWR_AWU_Prescaler */
#define AWU_Prescaler_1       ((uint32_t)0x00000000)
#define AWU_Prescaler_2       ((uint32_t)0x00000002)
#define AWU_Prescaler_4       ((uint32_t)0x00000003)
#define AWU_Prescaler_8       ((uint32_t)0x00000004)
#define AWU_Prescaler_16      ((uint32_t)0x00000005)
#define AWU_Prescaler_32      ((uint32_t)0x00000006)
#define AWU_Prescaler_64      ((uint32_t)0x00000007)
#define AWU_Prescaler_128     ((uint32_t)0x00000008)
#define AWU_Prescaler_256     ((uint32_t)0x00000009)
#define AWU_Prescaler_512     ((uint32_t)0x0000000A)
#define AWU_Prescaler_1024    ((uint32_t)0x0000000B)
#define AWU_Prescaler_2048    ((uint32_t)0x0000000C)
#define AWU_Prescaler_4096    ((uint32_t)0x0000000D)
#define AWU_Prescaler_10240   ((uint32_t)0x0000000E)
#define AWU_Prescaler_61440   ((uint32_t)0x0000000F)


/* ch32v00x_dbgmcu.h ---------------------------------------------------------*/
/* CFGR0 Register */
#define DBGMCU_SLEEP                 ((uint32_t)0x00000001)
#define DBGMCU_STOP                  ((uint32_t)0x00000002)
#define DBGMCU_STANDBY               ((uint32_t)0x00000004)
#define DBGMCU_IWDG_STOP             ((uint32_t)0x00000100)
#define DBGMCU_WWDG_STOP             ((uint32_t)0x00000200)
#define DBGMCU_TIM1_STOP             ((uint32_t)0x00001000)
#define DBGMCU_TIM2_STOP             ((uint32_t)0x00002000)
#define DBGMCU_TIM3_STOP             ((uint32_t)0x00004000)

/* ch32v00x_dma.h ------------------------------------------------------------*/

/* DMA_data_transfer_direction */
#define DMA_DIR_PeripheralDST              ((uint32_t)0x00000010)
#define DMA_DIR_PeripheralSRC              ((uint32_t)0x00000000)

/* DMA_peripheral_incremented_mode */
#define DMA_PeripheralInc_Enable           ((uint32_t)0x00000040)
#define DMA_PeripheralInc_Disable          ((uint32_t)0x00000000)

/* DMA_memory_incremented_mode */
#define DMA_MemoryInc_Enable               ((uint32_t)0x00000080)
#define DMA_MemoryInc_Disable              ((uint32_t)0x00000000)

/* DMA_peripheral_data_size */
#define DMA_PeripheralDataSize_Byte        ((uint32_t)0x00000000)
#define DMA_PeripheralDataSize_HalfWord    ((uint32_t)0x00000100)
#define DMA_PeripheralDataSize_Word        ((uint32_t)0x00000200)

/* DMA_memory_data_size */
#define DMA_MemoryDataSize_Byte            ((uint32_t)0x00000000)
#define DMA_MemoryDataSize_HalfWord        ((uint32_t)0x00000400)
#define DMA_MemoryDataSize_Word            ((uint32_t)0x00000800)

/* DMA_circular_normal_mode */
#define DMA_Mode_Circular                  ((uint32_t)0x00000020)
#define DMA_Mode_Normal                    ((uint32_t)0x00000000)

/* DMA_priority_level */
#define DMA_Priority_VeryHigh              ((uint32_t)0x00003000)
#define DMA_Priority_High                  ((uint32_t)0x00002000)
#define DMA_Priority_Medium                ((uint32_t)0x00001000)
#define DMA_Priority_Low                   ((uint32_t)0x00000000)

/* DMA_memory_to_memory */
#define DMA_M2M_Enable                     ((uint32_t)0x00004000)
#define DMA_M2M_Disable                    ((uint32_t)0x00000000)

/* DMA_interrupts_definition */
#define DMA_IT_TC                          ((uint32_t)0x00000002)
#define DMA_IT_HT                          ((uint32_t)0x00000004)
#define DMA_IT_TE                          ((uint32_t)0x00000008)

#define DMA1_IT_GL1                        ((uint32_t)0x00000001)
#define DMA1_IT_TC1                        ((uint32_t)0x00000002)
#define DMA1_IT_HT1                        ((uint32_t)0x00000004)
#define DMA1_IT_TE1                        ((uint32_t)0x00000008)
#define DMA1_IT_GL2                        ((uint32_t)0x00000010)
#define DMA1_IT_TC2                        ((uint32_t)0x00000020)
#define DMA1_IT_HT2                        ((uint32_t)0x00000040)
#define DMA1_IT_TE2                        ((uint32_t)0x00000080)
#define DMA1_IT_GL3                        ((uint32_t)0x00000100)
#define DMA1_IT_TC3                        ((uint32_t)0x00000200)
#define DMA1_IT_HT3                        ((uint32_t)0x00000400)
#define DMA1_IT_TE3                        ((uint32_t)0x00000800)
#define DMA1_IT_GL4                        ((uint32_t)0x00001000)
#define DMA1_IT_TC4                        ((uint32_t)0x00002000)
#define DMA1_IT_HT4                        ((uint32_t)0x00004000)
#define DMA1_IT_TE4                        ((uint32_t)0x00008000)
#define DMA1_IT_GL5                        ((uint32_t)0x00010000)
#define DMA1_IT_TC5                        ((uint32_t)0x00020000)
#define DMA1_IT_HT5                        ((uint32_t)0x00040000)
#define DMA1_IT_TE5                        ((uint32_t)0x00080000)
#define DMA1_IT_GL6                        ((uint32_t)0x00100000)
#define DMA1_IT_TC6                        ((uint32_t)0x00200000)
#define DMA1_IT_HT6                        ((uint32_t)0x00400000)
#define DMA1_IT_TE6                        ((uint32_t)0x00800000)
#define DMA1_IT_GL7                        ((uint32_t)0x01000000)
#define DMA1_IT_TC7                        ((uint32_t)0x02000000)
#define DMA1_IT_HT7                        ((uint32_t)0x04000000)
#define DMA1_IT_TE7                        ((uint32_t)0x08000000)
#define DMA1_IT_GL8                        ((uint32_t)0x10000000)
#define DMA1_IT_TC8                        ((uint32_t)0x20000000)
#define DMA1_IT_HT8                        ((uint32_t)0x40000000)
#define DMA1_IT_TE8                        ((uint32_t)0x80000000)


