cnlohr/ch32fun/ch32fun/ch32m030hw.h
/* ch32v00x_misc.h -----------------------------------------------------------*/

/* Preemption_Priority_Group */
#define NVIC_PriorityGroup_0           ((uint32_t)0x00)
#define NVIC_PriorityGroup_1           ((uint32_t)0x01)
#define NVIC_PriorityGroup_2           ((uint32_t)0x02)
#define NVIC_PriorityGroup_3           ((uint32_t)0x03)
#define NVIC_PriorityGroup_4           ((uint32_t)0x04)

/* ch32v00x_opa.h ------------------------------------------------------------*/

/* Editor's note: I don't know if this is actually useful */
#ifndef __ASSEMBLER__


/* OPA_member_enumeration */
typedef enum
{
    OPA1 = 0,
    OPA2
} OPA_Num_TypeDef;

/* OPA_out_channel_enumeration */
typedef enum
{
    OUT_IO_OUT0 = 0,
    OUT_IO_OUT1
} OPA_Mode_TypeDef;


/* OPA PSEL enumeration */
typedef enum
{
    CHP0 = 0,
    CHP1,
    CHP2,
    CHP_OFF
} OPA_PSEL_TypeDef;

/* OPA_FB_enumeration */
typedef enum
{
    FB_OFF = 0,
    FB_ON
} OPA_FB_TypeDef;

/* OPA NSEL enumeration */
typedef enum
{
    CHN0 = 0,
    CHN1,
    CHN2_PGA_16xIN,
    CHN_PGA_4xIN,
    CHN_PGA_8xIN,
    CHN_PGA_16xIN,
    CHN_PGA_32xIN,
    CHN_OFF
} OPA_NSEL_TypeDef;

/* OPA_PSEL_POLL_enumeration */
typedef enum
{
    CHP_OPA1_OFF_OPA2_OFF = 0,
    CHP_OPA1_ON_OPA2_OFF,
    CHP_OPA1_OFF_OPA2_ON,
    CHP_OPA1_ON_OPA2_ON
} OPA_PSEL_POLL_TypeDef;

/* OPA_BKIN_EN_enumeration */
typedef enum
{
    BKIN_OPA1_OFF_OPA2_OFF = 0,
    BKIN_OPA1_ON_OPA2_OFF,
    BKIN_OPA1_OFF_OPA2_ON,
    BKIN_OPA1_ON_OPA2_ON
} OPA_BKIN_EN_TypeDef;

/* OPA_RST_EN_enumeration */
typedef enum
{
    RST_OPA1_OFF_OPA2_OFF = 0,
    RST_OPA1_ON_OPA2_OFF,
    RST_OPA1_OFF_OPA2_ON,
    RST_OPA1_ON_OPA2_ON
} OPA_RST_EN_TypeDef;

/* OPA_BKIN_SEL_enumeration */
typedef enum
{
    BKIN_OPA1_TIM1_OPA2_TIM2 = 0,
    BKIN_OPA1_TIM2_OPA2_TIM1
} OPA_BKIN_SEL_TypeDef;

/* OPA_OUT_IE_enumeration */
typedef enum
{
    OUT_IE_OPA1_OFF_OPA2_OFF = 0,
    OUT_IE_OPA1_ON_OPA2_OFF,
    OUT_IE_OPA1_OFF_OPA2_ON,
    OUT_IE_OPA1_ON_OPA2_ON
} OPA_OUT_IE_TypeDef;

/* OPA_CNT_IE_enumeration */
typedef enum
{
    CNT_IE_OFF = 0,
    CNT_IE_ON,
} OPA_CNT_IE_TypeDef;

/* OPA_NMI_IE_enumeration */
typedef enum
{
    NMI_IE_OFF = 0,
    NMI_IE_ON,
} OPA_NMI_IE_TypeDef;

/* OPA_PSEL_POLL_NUM_enumeration */
typedef enum
{
    CHP_POLL_NUM_1 = 0,
    CHP_POLL_NUM_2,
    CHP_POLL_NUM_3
} OPA_PSEL_POLL_NUM_TypeDef;



/* OPA Init Structure definition */
typedef struct
{
    uint16_t                  OPA_POLL_Interval; /* OPA polling interval = (OPA_POLL_Interval+1)*1us
                                                      This parameter must range from 0 to 0x1FF.*/
    OPA_Num_TypeDef           OPA_NUM;  /* Specifies the members of OPA */
    OPA_Mode_TypeDef          Mode;     /* Specifies the mode of OPA */
    OPA_PSEL_TypeDef          PSEL;     /* Specifies the positive channel of OPA */
    OPA_FB_TypeDef            FB;       /* Specifies the internal feedback resistor of OPA */
    OPA_NSEL_TypeDef          NSEL;     /* Specifies the negative channel of OPA */
    OPA_PSEL_POLL_TypeDef     PSEL_POLL; /* Specifies the positive channel poll of OPA */
    OPA_BKIN_EN_TypeDef       BKIN_EN;  /* Specifies the brake input source of OPA */
    OPA_RST_EN_TypeDef        RST_EN;   /* Specifies the reset source of OPA */
    OPA_BKIN_SEL_TypeDef      BKIN_SEL; /* Specifies the brake input source selection of OPA */
    OPA_OUT_IE_TypeDef        OUT_IE;   /* Specifies the out interrupt of OPA */
    OPA_CNT_IE_TypeDef        CNT_IE;   /* Specifies the out interrupt rising edge of sampling data */
    OPA_NMI_IE_TypeDef        NMI_IE;   /* Specifies the out NIM interrupt of OPA */
    OPA_PSEL_POLL_NUM_TypeDef POLL_NUM; /* Specifies the number of forward inputs*/
} OPA_InitTypeDef;

/* CMP_member_enumeration */
typedef enum
{
    CMP1 = 0,
    CMP2,
    CMP3
} CMP_Num_TypeDef;

/* CMP_out_channel_enumeration */
typedef enum
{
    OUT_IO_TIM2 = 0,
    OUT_IO0
} CMP_Mode_TypeDef;

/* CMP_NSEL_enumeration */
typedef enum
{
    CMP_CHN0 = 0,
    CMP_CHN1,
} CMP_NSEL_TypeDef;

/* CMP_PSEL_enumeration */
typedef enum
{
    CMP_CHP1 = 0,
    CMP_CHP2,
} CMP_PSEL_TypeDef;

/* CMP_HYEN_enumeration */
typedef enum
{
    CMP_HYEN1 = 0,
    CMP_HYEN2,
} CMP_HYEN_TypeDef;

/* CMP Init Structure definition */
typedef struct
{
    CMP_Num_TypeDef    CMP_NUM;  /* Specifies the members of CMP */
    CMP_Mode_TypeDef   Mode;     /* Specifies the mode of CMP */
    CMP_NSEL_TypeDef   NSEL;     /* Specifies the negative channel of CMP */
    CMP_PSEL_TypeDef   PSEL;     /* Specifies the positive channel of CMP */
    CMP_HYEN_TypeDef   HYEN;     /* Specifies the hysteresis comparator of CMP */
} CMP_InitTypeDef;

/* OPA_flags_definition */
#define OPA_FLAG_OUT_OPA1                  ((uint16_t)0x1000)
#define OPA_FLAG_OUT_OPA2                  ((uint16_t)0x2000)
#define OPA_FLAG_OUT_CNT                   ((uint16_t)0x4000)

#endif

/* ch32v00x_pwr.h ------------------------------------------------------------*/

/* PVD_detection_level  */
#define PWR_PVDLevel_0            ((uint32_t)0x00000000)
#define PWR_PVDLevel_1            ((uint32_t)0x00000020)
#define PWR_PVDLevel_2            ((uint32_t)0x00000040)
#define PWR_PVDLevel_3            ((uint32_t)0x00000060)

#define PWR_PVDLevel_2V1          PWR_PVDLevel_0
#define PWR_PVDLevel_2V3          PWR_PVDLevel_1
#define PWR_PVDLevel_3V0          PWR_PVDLevel_2
#define PWR_PVDLevel_4V0          PWR_PVDLevel_3


/* STOP_mode_entry */
#define PWR_STOPEntry_WFI         ((uint8_t)0x01)
#define PWR_STOPEntry_WFE         ((uint8_t)0x02)

/* PWR_Flag */
#define PWR_FLAG_PVDO             ((uint32_t)0x00000004)
#define PWR_FLAG_FLASH            ((uint32_t)0x00000020)


/* ch32v00x_rcc.h ------------------------------------------------------------*/


/* HSE_configuration */
#define RCC_HSE_OFF                      ((uint32_t)0x00000000)
#define RCC_HSE_ON                       ((uint32_t)0x00010000)
#define RCC_HSE_Bypass                   ((uint32_t)0x00040000)


/* System_clock_source */
#define RCC_SYSCLKSource_HSI             ((uint32_t)0x00000000)
#define RCC_SYSCLKSource_HSE             ((uint32_t)0x00000001)
#define RCC_SYSCLKSource_PLLCLK          ((uint32_t)0x00000002)


/* AHB_clock_source */
#define RCC_SYSCLK_Div1                  ((uint32_t)0x00000000)
#define RCC_SYSCLK_Div2                  ((uint32_t)0x00000010)
#define RCC_SYSCLK_Div3                  ((uint32_t)0x00000020)
#define RCC_SYSCLK_Div4                  ((uint32_t)0x00000030)
#define RCC_SYSCLK_Div5                  ((uint32_t)0x00000040)
#define RCC_SYSCLK_Div6                  ((uint32_t)0x00000050)
#define RCC_SYSCLK_Div7                  ((uint32_t)0x00000060)
#define RCC_SYSCLK_Div8                  ((uint32_t)0x00000070)
#define RCC_SYSCLK_Div16                 ((uint32_t)0x000000B0)
#define RCC_SYSCLK_Div32                 ((uint32_t)0x000000C0)
#define RCC_SYSCLK_Div64                 ((uint32_t)0x000000D0)
#define RCC_SYSCLK_Div128                ((uint32_t)0x000000E0)
#define RCC_SYSCLK_Div256                ((uint32_t)0x000000F0)

